[
    {
        "id": 1,
        "estate_title": "Oceanfront Paradise Villa",
        "image": "https://images.pexels.com/photos/3155666/pexels-photo-3155666.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1",
        "segment_name": "Luxury Villas",
        "description": "A stunning villa with breathtaking ocean views, modern amenities, and luxurious finishes. This oceanfront paradise offers expansive living spaces, a state-of-the-art kitchen, and a private theater for an unparalleled living experience. Enjoy the serene sounds of the ocean from the private beach access or take a dip in the infinity pool. The villa is designed with exquisite attention to detail, ensuring that every moment spent here is nothing short of extraordinary. Ideal for those seeking a luxurious and tranquil retreat.",
        "price": 3500000,
        "status": "sale",
        "area": "5000 sqft",
        "location": "Malibu, CA",
        "facilities": ["living room", "swimming pool", "kitchen", "home theater", "private beach access"]
    },
    {
        "id": 2,
        "estate_title": "Downtown Luxury Penthouse",
        "image": "https://images.pexels.com/photos/323780/pexels-photo-323780.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1",
        "segment_name": "Penthouse",
        "description": "Experience urban living at its finest in this luxurious penthouse with panoramic city views. Located in the heart of New York, this penthouse offers an unparalleled lifestyle with its sleek modern design and top-of-the-line amenities. The expansive living area features floor-to-ceiling windows, providing breathtaking views of the city skyline. Relax on the private rooftop terrace, or take advantage of the building's fitness center and swimming pool. This penthouse is perfect for those who appreciate sophistication and convenience in a vibrant urban setting.",
        "price": 4500000,
        "status": "sale",
        "area": "3000 sqft",
        "location": "New York, NY",
        "facilities": ["living room", "swimming pool", "kitchen", "rooftop terrace", "gym"]
    },
    {
        "id": 3,
        "estate_title": "Countryside Mansion Retreat",
        "image": "https://images.pexels.com/photos/5997996/pexels-photo-5997996.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1",
        "segment_name": "Mansion",
        "description": "A secluded mansion nestled in the countryside, perfect for a private and tranquil living experience. This expansive estate offers luxurious living with its spacious interiors, gourmet kitchen, and elegant design. The mansion features a spa, tennis court, and a beautiful swimming pool, making it an ideal retreat for relaxation and recreation. Surrounded by nature, the property provides a peaceful escape from the hustle and bustle of city life, offering privacy and serenity. This countryside retreat is perfect for those seeking a blend of luxury and nature.",
        "price": 5200000,
        "status": "rent",
        "area": "10000 sqft",
        "location": "Aspen, CO",
        "facilities": ["living room", "swimming pool", "kitchen", "spa", "tennis court"]
    },
    {
        "id": 4,
        "estate_title": "Modern High-Rise Apartment",
        "image": "https://images.pexels.com/photos/9259645/pexels-photo-9259645.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1",
        "segment_name": "Apartments",
        "description": "A chic and modern apartment in a high-rise building, offering stunning views and top-of-the-line amenities. Located in the vibrant city of San Francisco, this apartment features contemporary design, spacious living areas, and floor-to-ceiling windows that provide panoramic views of the city and the bay. The building offers exclusive amenities, including a swimming pool, fitness center, and concierge service, ensuring a luxurious and convenient lifestyle. Perfect for those who desire a stylish urban residence with all the modern comforts.",
        "price": 2500000,
        "status": "sale",
        "area": "1500 sqft",
        "location": "San Francisco, CA",
        "facilities": ["living room", "swimming pool", "kitchen", "gym", "concierge service"]
    },
    {
        "id": 5,
        "estate_title": "Beachside Luxury Condo",
        "image": "https://images.pexels.com/photos/20799209/pexels-photo-20799209/free-photo-of-sea-with-waves-and-a-luxury-resort-on-the-coast.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1",
        "segment_name": "Condominium",
        "description": "A luxurious condo located just steps from the beach, with modern interiors and beautiful ocean views. This beachside residence offers an elegant and relaxed lifestyle with its spacious living areas, high-end kitchen, and private balcony overlooking the ocean. Enjoy the convenience of beach access and the comfort of contemporary design. The condo features exclusive amenities, including a swimming pool and a fitness center, making it an ideal home for those who appreciate both luxury and the soothing ambiance of the seaside.",
        "price": 1800000,
        "status": "rent",
        "area": "2200 sqft",
        "location": "Miami, FL",
        "facilities": ["living room", "swimming pool", "kitchen", "private balcony", "beach access"]
    },
    {
        "id": 6,
        "estate_title": "Suburban Family Home",
        "image": "https://images.pexels.com/photos/3935333/pexels-photo-3935333.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1",
        "segment_name": "Family Homes",
        "description": "A beautiful suburban home perfect for families, located in a quiet neighborhood. This spacious home features a large backyard, modern kitchen, and cozy living spaces. Enjoy the comfort of suburban living with excellent schools, parks, and community amenities nearby. The home is designed for family life with ample bedrooms, a playroom, and a family-friendly layout. Ideal for those seeking a peaceful and welcoming community.",
        "price": 850000,
        "status": "sale",
        "area": "3200 sqft",
        "location": "Austin, TX",
        "facilities": ["living room", "kitchen", "backyard", "playroom", "garage"]
    },
    {
        "id": 7,
        "estate_title": "City Center Studio Apartment",
        "image": "https://images.pexels.com/photos/6045336/pexels-photo-6045336.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1",
        "segment_name": "Studio Apartments",
        "description": "A modern studio apartment located in the heart of the city, perfect for singles or young professionals. This compact yet stylish apartment offers convenience and comfort with its contemporary design, efficient use of space, and high-quality finishes. The building includes amenities such as a fitness center and rooftop lounge. Ideal for those who want to be in the center of urban activity.",
        "price": 550000,
        "status": "sale",
        "area": "600 sqft",
        "location": "Chicago, IL",
        "facilities": ["living room", "kitchen", "fitness center", "rooftop lounge", "24/7 security"]
    },
    {
        "id": 8,
        "estate_title": "Luxury Mountain Cabin",
        "image": "https://images.pexels.com/photos/2479641/pexels-photo-2479641.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1",
        "segment_name": "Cabins",
        "description": "A luxury cabin nestled in the mountains, offering a serene escape with stunning views. This cabin features rustic charm with modern amenities, including a gourmet kitchen, hot tub, and large deck overlooking the mountains. Perfect for nature lovers and those seeking a peaceful retreat, the cabin provides easy access to hiking trails and outdoor activities. Ideal for a weekend getaway or a seasonal home.",
        "price": 1200000,
        "status": "sale",
        "area": "2800 sqft",
        "location": "Jackson, WY",
        "facilities": ["living room", "kitchen", "hot tub", "deck", "fireplace"]
    },
    {
        "id": 9,
        "estate_title": "Historic Townhouse",
        "image": "https://images.pexels.com/photos/20859596/pexels-photo-20859596/free-photo-of-seaside-franciscan-monastery-and-museum-in-hvar-croatia.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1",
        "segment_name": "Townhouses",
        "description": "A charming historic townhouse located in a picturesque neighborhood. This beautifully restored property features original architectural details combined with modern updates. The townhouse offers spacious living areas, a modern kitchen, and a private garden. Situated in a historic district, it provides a unique living experience with a sense of history and community. Perfect for those who appreciate classic architecture and a vibrant neighborhood.",
        "price": 950000,
        "status": "sale",
        "area": "2400 sqft",
        "location": "Charleston, SC",
        "facilities": ["living room", "kitchen", "garden", "dining room", "library"]
    }
]
